{"convertedBy": "TensorFlow.js Converter v1.0.1", "format": "layers-model", "generatedBy": "keras v2.2.4", "modelTopology": {"model_config": {"class_name": "Sequential", "config": {"layers": [{"config": {"recurrent_initializer": {"config": {"seed": null, "gain": 1.0}, "class_name": "Orthogonal"}, "unroll": false, "recurrent_activation": "hard_sigmoid", "kernel_constraint": null, "kernel_regularizer": null, "recurrent_dropout": 0.0, "go_backwards": false, "unit_forget_bias": true, "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "dropout": 0.0, "implementation": 1, "batch_input_shape": [5, 62, 50], "units": 10, "return_sequences": false, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_constraint": null, "name": "lstm_1", "trainable": true, "activity_regularizer": null, "activation": "tanh", "recurrent_regularizer": null, "bias_regularizer": null, "use_bias": true, "return_state": false, "dtype": "float32", "recurrent_constraint": null, "stateful": true}, "class_name": "LSTM"}, {"config": {"bias_constraint": null, "name": "dense_1", "kernel_constraint": null, "kernel_regularizer": null, "trainable": true, "activity_regularizer": null, "bias_regularizer": null, "use_bias": true, "activation": "sigmoid", "kernel_initializer": {"config": {"seed": null, "scale": 1.0, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense"}], "name": "sequential_1"}}, "keras_version": "2.2.4", "training_config": {"sample_weight_mode": null, "metrics": [], "loss_weights": null, "loss": "binary_crossentropy", "optimizer_config": {"class_name": "Adam", "config": {"beta_2": 0.9990000128746033, "epsilon": 1e-07, "beta_1": 0.8999999761581421, "amsgrad": false, "lr": 0.0010000000474974513, "decay": 0.0}}}, "backend": "theano"}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"shape": [10, 1], "name": "dense_1/kernel", "dtype": "float32"}, {"shape": [1], "name": "dense_1/bias", "dtype": "float32"}, {"shape": [50, 40], "name": "lstm_1/kernel", "dtype": "float32"}, {"shape": [10, 40], "name": "lstm_1/recurrent_kernel", "dtype": "float32"}, {"shape": [40], "name": "lstm_1/bias", "dtype": "float32"}]}]}